{Натуральное число из n цифр является числом Армстронга, если сумма его цифр,
возведенных в n-уюстепень равна самому числу, например, 
153=13+53+33. Получить все числа Армстронга, 
состоящие из двух, трех и четырех цифр,
организовать соответственно 3 однонаправленных списка.}

program Est;

type
  mss = ^mas;
  mas = array of integer;
      
var
  m: mss;
  n,
  x, {пробное n-значное число}
  min, {наименьшее n-значное число}
  max,{наибольшее n-значное число}
  s, {сумма n-x степеней цифр числа x}
  k, l, p: integer;

begin
  n := 1;
  {заполняется массив M}
  repeat
    new(m);
    m^ := nil; {указатель пуст}
    setlength(m^, 10);
    write(n, ' список: ');
    inc(n);
    for k := 0 to m^.length - 1 do
    begin
      m^[k] := k;
      for l := 2 to n do
        m^[k] := m^[k] * k
    end;
    {находятся наименьшее и наибольшее n-значные числа: min и max}
    min := 1;
    for l := 1 to n - 1 do
      min := min * 10;
    max := min * 10 - 1;
    {испытываются все n-значные числа}
    for x := min to max do
    begin
      p := x;
      s := 0;
      {находится сумма n-x степеней цифр числа х}
      for l := 1 to n do
      begin
        s := s + m^[p mod 10];
        p := p div 10
      end;
      if s = x then {x - число Армстронга}
        write(x, ' ')
    end;
    writeln;
  until n = 4;
end.