'''
Требуется разработать приложение, которое по заданным значениям коэффициентов
a, b и c квадратного уравнения (значения вводятся с клавиатуры пользователем)
вычисляет и отображает на экране корни уравнения.
'''
print('Введите коэффициенты a, b и c соответственно: ')
a = float(input())
b = float(input())
c = float(input())
D = pow(b, a) - 4 * a * c
if D > 0:
    import math
    D = math.sqrt(D)
    k1 = (-b + D) / 2 * a
    k2 = (-b - D) / 2 * a
    print('Дискриминант: ', D, ', первый корень: ', k1, ', второй корень: ', k2)
elif D == 0:
    k1 = -b / 2 * a
    print('Дискриминант: ', D, ' корень уравнения: ', k1)
else:
    print('Корней нет')
