#Написать программу, которая реализует диалог с пользователем:
#Запрашивает с клавиатуры два целых числа, и выводит на экран сумму данных чисел: 
print('Задание 1.')
a = int(input('a = '))
b = int(input('b = '))
print(a, '+', b, '=', a + b)

#Написать программу:
#Дано двузначное число. Найти число десятков в нем.
print('Задание 2.')
a = int(input('Введите двузначное число: '))
print('Число десятков: ', a // 10)

#Написать программу, которая подсчитывает:
#Периметр квадрата, площадь которого равна а
print('Задание 3.')
a = float(input('Укажите площадь квадрата: '))
from math import *
print('Периметр квадрата = ', sqrt(a) * 4)

#Написать программу:
#Считая, что Земля – идеальная сфера с радиусом равным 6350 км,
#определить расстояние до линии горизонта от точки с заданной высотой над Землей.
print('Задание 4.')
a = int(input('Введите расстояние над Землей: '))
print('Расстояние до линии горизонта = ', 6350 - a)

#Написать программу:
#Дано целое положительное число n.
#Присвойте переменной m последнюю цифру этого числа.
print('Задание 5.')
n = int(input('Введите n: '))
m = n % 10
print('Последняя цифра числа = ', m)

#а4 за две операции, а – действительное число, при этом не пользуясь
#никакими другими арифметическими операциями, кроме умножения.
print('Задание 7.')
a = float(input('Введите число: '))
a1 = a * a
a2 = a1 * a1
print('Результат = ', a2)
