import math 
'''
#    {pow(x, 2) * log10(x), 1 <= x <= 2
# y ={1, x < 1
#    {pow(e, 2 * x) * cos(5) * x, x > 2
print('Задание 1.')
x = float(input('Введите x: '))
if (x < 1):
    y = 1
elif (x > 2):
    y = math.pow(math.e, 2 * x) * math.cos(5) * x
else:
    y = pow(x, 2) * math.log10(x)
print('y = ', y)

#Написать программу, которая определяет максимальное
#значение для двух различных вещественных чисел.
print('Задание 2.')
print('Введите два числа для нахождения максимального из них.')
a = float(input('Первое число: '))
b = float(input('Второе число: '))
if (a > b):
    print('Первое число больше, оно = ', a)
else:
    print('Второе число больше, оно = ', b)
'''
#Дана точка на плоскости с координатами (х, у).
#Составить программу, которая выдает одно из сообщений:
#"Да", "Нет", "На границе" в зависимости от того,
#лежит ли точка внутри заштрихованной области,
#вне заштрихованной области или на ее границе
print('Задание 3.')
print('Введите координаты x и y.')
x = float(input('x: '))
y = float(input('y: '))
if (((x == 3 or x == -3) and y == 3) or ((x == math.pi * math.pow(3, 2) or (x == -(math.pi * math.pow(3, 2))) and (y == math.pi * math.pow(3, 2))))):
    print('На границе')
elif (((x < 3 or x > -3) and y < 3) or ((x < math.pi * math.pow(3, 2) or (x > -(math.pi * math.pow(3, 2))) and (y < math.pi * math.pow(3, 2))))):
    print('Да')
else:
    print('Нет')
