{Используя перечень номиналов ассигнаций и монет:
Const  Nominal: array[0..10] of currency= (5000, 1000, 500, 100, 50, 10, 5, 1, 0.5, 0.1);  ,
запрограммировать "жадный" алгоритм формирования заданной сдачи кассиром. Общее число купюр и монет в сдаче должно получиться минимальным. 
Организовать сервис-диалог с кассиром для выяснения обстоятельств наличия номиналов в кассе и учесть в программе возможность отсутствия ассигнаций того или иного номинала.}
const
  many: array [1..10] of Real = (5000, 1000, 500, 100, 50, 10, 5, 1, 0.5, 0.1);// наименование купюр

var
  in_kol: array [1..10] of Real; // количество  заданных купюр
  out_kol: array [1..10] of Real;// количество потраченных купюр
  startsum, sum, tmp: Real;
  s: string;

begin
  // Очищаем массивы
  for var i := 1 to 10 do
  begin
    in_kol[i] := 0;
    out_kol[i] := 0;
  end;
  // Сумма для выдачи
  write('Введите сумму для выдачи купюр: ');
  readln(sum);
  startsum := sum;
  // Ввод количества купюр в порядке их наименования
  for var i := 1 to 10 do
  begin
    write('Купюр достоинством ', many[i], ' = ');
    readln(in_kol[i]);
  end;
  tmp := 0;
  //
  for var i := 1 to 10 do
  begin
    // Если таких купюр нет или Купюра больше суммы - пропускаем
    if (many[i] > sum) or (in_kol[i] <= 0) then
      continue;
    tmp := Trunc (sum / many[i]);
    // Проверка на количество купюр и их выдача
    if tmp <= in_kol[i] then out_kol[i] := tmp
    else out_kol[i] := in_kol[i];
    // Устанавливаем новое значения заданных купюр
    in_kol[i] := in_kol[i] - out_kol[i];
    // Уменьшаем сумму на число выданных купюр
    sum := sum - (out_kol[i] * many[i]);
    // Еслии раньше времени цикла закончили выдачу - выход
    if sum = 0 then break;
  end;
  // Справка
  s := ' Выдано: '#13#10;
  for var i := 1 to 10 do
    if out_kol[i] <> 0 then
      s := s + 'Купюры по ' + FloatToStr(many[i]) + ' в количестве ' + FloatToStr(out_kol[i]) + ' шт.' + #13#10;
  if sum <> 0 then 
    writeln('Не возможно выдать заданную сумму. Только так ' + #13#10 + s)
  else writeln(s);
  writeln('Всего выдано: ', (startsum - sum), '!');
end.