program Est;
var mas: array [1..100] of integer;
i,a,b,n: integer;
begin
write('A=');
readln(a); {Ввожу А и Б}
write('B=');
readln(b);
mas[1]:=13; {Присваиваю первому элементу значение 13}
for i:=2 to 100 do
mas[i]:= mas[i-1]+11; {Выполняю арифметическую прогрессию}
write('Количество членов, учавствующих в арифметической прогрессии от A до B: ');
n:=b-a; {Определяю количество учавствующих членов в арифметической прогресси}
writeln(n); {Вывожу количество учавствующих членов в арифметической прогресси}
write('Члены арифметической прогрессии от A до B: ');
for i:=a to b do 
write(mas[i],' '); {Вывожу члены арифметической прогрессии от A до B}
for i:=1 to 100 do
if mas[i] mod 2=0 then mas[i]:=0;
writeln;
writeln('Члены арифметической прогрессии от A до B, где четные заменены нулями и их номера: ');
for i:=a to b do 
writeln(mas[i],' ',i);
end.