//Известен набор продуктов: хлеб, масло; сыр, молоко; имеющиеся в ассортементе магазинов. 
//В три магазина доставлены отдельные виды этих продуктов. Требуется постоить множества
//A, B, C, которые содержат продукты: хлеб, масло, сыр, молоко; имеющиеся, по крайней мере, в одном из этих магазинов.
Const
  A = ['хлеб', 'масло', 'сыр', 'молоко'];
  
Type
  Letters = set of string;
  
Var
  Text : String;
  i: byte;
  
Begin 
  for i := 1 to 3 do
  begin
  Write('Введите продукт: ');
  Readln(Text);
  if (Text in A) then          
    Writeln('Продукт имеется в магазине ' + i)
  else
    Writeln('Продукт не имеется в магазине ' + i);
  end;
End.