program Est;

var
  x: integer;
  y: real;

begin
  writeln('Заданная функция представленна в виде таблице:');
  writeln;
  writeln('__________________________________________');
  writeln('Y =-2,4*х2+5*х-3', '|':3, 'X':7, '|':3, 'Y':10, '|':3);
  writeln('__________________________________________');
  for x := -5 to 5 do
  begin
    y := -2.4 * sqr(x) + 5 * x - 3;
    writeln('Y =-2,4*', sqr(x), '+5*', 'х', '-3', '|':3, X:7, '|':3, Y:10, '|':3);
    writeln('__________________________________________');
  end;
end.